app/views/treatments/_form.html.haml

    = f.label :patient_id
    = collection_select(:treatment, :patient_id, Patient.all, :id, :firstname,{}, prompt: true)
  .field
    = f.label :doctor_id
    = collection_select(:treatment, :doctor_id, Doctor.all, :id, :firstname,{}, prompt: true )
  .field
---
SELECT "patients".* FROM "patients"
SELECT "doctors".* FROM "doctors"