app/views/treatments/index.html.haml

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
      %tr
        - p = Patient.find_by_id(treatment.patient_id)
        - d = Doctor.find_by_id(treatment.doctor_id)