app/views/areas/_form.html.haml

SELECT "doctors".* FROM "doctors" ORDER BY speciality ASC
---
    = f.label :leader
    = collection_select(:area, :leader, Doctor.order("speciality ASC").all, :id, :name_with_speciality,{}, prompt: true )
  .field