app/views/areas/index.html.haml

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      %tr
        - d = Doctor.find_by_id(area.leader)