app/views/doctors/_form.html.haml

    = f.label :area_id
    = collection_select(:doctor, :area_id, Area.order("name ASC").all, :id, :name_with_location,{}, prompt: true)
  .field
---
SELECT "areas".* FROM "areas" ORDER BY name ASC