app/views/doctors/index.html.haml

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      %tr
        - a = Area.find_by_id(doctor.area_id)