app/controllers/areas_controller.rb

  def index
    @areas = Area.all
---
SELECT "areas".* FROM "areas"

  def create
    @area = Area.new(area_params)

    respond_to do |format|
      if @area.save
---
INSERT INTO "areas" ("leader", "name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["leader", 1], ["name", "Radiology"], ["location", "Zona 1"], ["created_at", "2017-11-20 08:36:03.138394"], ["updated_at", "2017-11-20 08:36:03.138394"]]

  def update
    respond_to do |format|
      if @area.update(area_params)
---
UPDATE "areas" SET "leader" = $1, "updated_at" = $2 WHERE "areas"."id" = $3  [["leader", 12], ["updated_at", "2017-11-22 09:24:18.458552"], ["id", 11]]

    def set_area
      @area = Area.find(params[:id])
---
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]