app/controllers/calendars_controller.rb

INSERT INTO "calendars" ("fecha", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["fecha", "2017-11-22"], ["created_at", "2017-11-22 18:54:17.949014"], ["updated_at", "2017-11-22 18:54:17.949014"]]
---
  def create
    @calendar = Calendar.new(calendar_params)

    respond_to do |format|
      if @calendar.save

UPDATE "calendars" SET "fecha" = $1, "updated_at" = $2 WHERE "calendars"."id" = $3  [["fecha", "2018-11-22"], ["updated_at", "2017-11-22 19:46:15.770983"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @calendar.update(calendar_params)

SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_calendar
      @calendar = Calendar.find(params[:id])