app/controllers/doctors_controller.rb

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("speciality", "yearsexperience") VALUES ($1, $2) RETURNING "id"  [["speciality", "Traumatologo"], ["yearsexperience", 4]]

  def update
    respond_to do |format|
      if @doctor.update(doctor_params)
---
UPDATE "doctors" SET "speciality" = $1 WHERE "doctors"."id" = $2  [["speciality", "Radiology"], ["id", 1]]