app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("insuranceplan") VALUES ($1) RETURNING "id"  [["insuranceplan", "ISSSTE"]]

  def update
    respond_to do |format|
      if @patient.update(patient_params)
---
UPDATE "patients" SET "insuranceplan" = $1 WHERE "patients"."id" = $2  [["insuranceplan", "PREMIUM"], ["id", 1]]