app/controllers/treatments_controller.rb

  def index
    @treatments = Treatment.all
---
SELECT "treatments".* FROM "treatments"

  def create
    @treatment = Treatment.new(treatment_params)

    respond_to do |format|
      if @treatment.save
---
INSERT INTO "treatments" ("duration", "medicaments", "prescription", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["duration", "5 dias"], ["medicaments", "Paracetamol"], ["prescription", "5 veces al dia"], ["created_at", "2017-11-20 06:14:06.366353"], ["updated_at", "2017-11-20 06:14:06.366353"]]

  def update
    respond_to do |format|
      if @treatment.update(treatment_params)
---
UPDATE "treatments" SET "patient_id" = $1, "doctor_id" = $2, "updated_at" = $3 WHERE "treatments"."id" = $4  [["patient_id", 1], ["doctor_id", 1], ["updated_at", "2017-11-20 06:24:17.432412"], ["id", 1]]

    def set_treatment
      @treatment = Treatment.find(params[:id])
---
SELECT  "treatments".* FROM "treatments" WHERE "treatments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]